'''
2. 문자열 프린트 하기  
문자열을 프린트 하기 위해서는 함수를 사용합니다.   
print 함수인데 이 함수의 사용법은 다음과 같습니다.  

print( 출력할 내용 )   

함수에 대해서는 다른 강좌에서 더욱 자세하게 배울 예정이기 때문에 길게 설명하지 않습니다. 
또한 print 함수에 넣게되는 출력하고 싶은 내용은 문자열 뿐만 아니라 다양한 자료가 될 수 있습니다.
'''

### print 함수를 사용하여 출력하기

# print('Hello Python3!')

### 참고. Python2 Python3의 다른점

# print 'Hello Python2' #Python2 의 print 사용법
# print('Hello Python3!') #Python3 의 print 사용법

### 변수에 문자열을 대입하여 출력하기 - 1

# s = 'Hello Python3!'
# print(s)

### 변수에 문자열을 대입하여 출력하기 - 2
# s = """안녕하세요 파이썬3 강좌입니다.
# 지금은 문자열에 대해서 배우고 있습니다. 
# 만약 여러 줄을 입력하는 경우에는 다음과 같이 사용할 수 있습니다."""

# print(s)

### 변수에 문자열을 대입하여 출력하기 - 3
# s = "안녕하세요 파이썬3 강좌입니다.\n지금은 문자열에 대해서 배우고 있습니다.\n만약 여러 줄을 입력하는 경우에는 다음과 같이 사용할 수 있습니다."
# print(s)