'''
1. 문자열 생성하기 
파이선의 특징 중 하나는 문자만을 저장하는 변수는 존재하지 않습니다. 파이썬에서 다루는 모든 문자는 문자열의 형태로 저장됩니다.
문자열을 생성하기 위해서는 기본적으로 다음과 같은 기호를 사용합니다.

'  '  (작은따옴표, Single quotes)
"  "  (큰따옴표, Dobule quotes)

위의 기호를 사용하면, 안에 있는 자료들은 문자열로 저장이 됩니다.
'''

#문자열 생성 작은 따옴표
'Hello'
'Hello Python3! I am a newbie.'
#문자열 생성 큰 따움표
"Hello"
"안녕하세요 파이썬의 문자열 생성을 배우는 학생 여러분!"

#문자열 생성 기호를 사용해야 하는 경우
'Hello Python3! I'm a newbie' #에러 발생!
"Hello Python3! I'm a newbie" #문자열 생성을 위한 기호는 항상 짝이 맞아야만 합니다. 문자열에 ' 혹은 " 가 있는 경우 주의합시다.

'강사가 이렇게 말했어요. "문자열 기호는 짝이 맞아야 합니다."'

'Hello Python3! I\'m a newbie'
